lib/stripe_model_callbacks/fixtures/stripe_events/payout/payout.created.json

{
  "created": 1326853478,
  "livemode": false,
  "id": "evt_00000000000000",
  "type": "payout.created",
  "object": "event",
  "request": null,
  "pending_webhooks": 1,
  "api_version": "2020-03-02",
  "data": {
    "object": {
      "id": "po_00000000000000",
      "object": "payout",
      "amount": 1100,
      "arrival_date": 1584471009,
      "automatic": true,
      "balance_transaction": "txn_00000000000000",
      "created": 1584471009,
      "currency": "usd",
      "description": "STRIPE PAYOUT",
      "destination": "ba_1GNkUPEKaFxLwikqmcMe5nxa",
      "failure_balance_transaction": null,
      "failure_code": null,
      "failure_message": null,
      "livemode": false,
      "metadata": {
      },
      "method": "standard",
      "source_type": "card",
      "statement_descriptor": null,
      "status": "in_transit",
      "type": "bank_account"
    }
  }
}